lib/tasks/bears.rake

                count_row += 1
                puts "Imported row #{count_row}"
                #import data from csv file
                Haul.create!(
                  echogramName: row[0],
                  fishDate: row[1].to_date,
                  strtFishTime: row[2],
                  stpFishTime: row[3],
                  strtFishLat: row[4].to_f,
                  stpFishLat: row[5].to_f,
                  strtFishLong: row[6].to_f,
                  stpFishLong: row[7].to_f,
                  strtFishDepth: row[8].to_f,
                  stpFishDepth: row[9].to_f,
                  bottomDepth: row[10].to_f
                )
---
INSERT INTO "hauls" ("echogramName", "fishDate", "strtFishTime", "stpFishTime", "strtFishLat", "stpFishLat", "strtFishLong", "stpFishLong", "strtFishDepth", "stpFishDepth", "bottomDepth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

                count_row += 1
                puts "Imported row #{count_row}"
                #import data from csv file
                Species.create!(
                  speciesCode: row[0].to_s,
                  scientificName: row[1],
                  englishName: row[2],
                  frenchName: row[3],
                  spanishName: row[4]
                )
---
INSERT INTO "species" ("speciesCode", "scientificName", "spanishName", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["speciesCode", "10182"], ["scientificName", "Lampanyctus crocodilus"], ["spanishName", "pez linterna"], ["created_at", "2020-06-11 09:53:10.968877"], ["updated_at", "2020-06-11 09:53:10.968877"]]