lib/tasks/bears.rake

  task seed_climate: :environment do
    User.destroy_all
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]