app/controllers/homepage_controller.rb

SELECT "hauls".* FROM "hauls"
---
  def haulrecord
    @hauls = Haul.all

SELECT "users".* FROM "users"
---
  def userrecord
    @users = User.all

SELECT "echograms".* FROM "echograms"
---
  def echogramdata
    @echograms = Echogram.all

SELECT "species".* FROM "species"
---
  def speciesrecord
    @species = Species.all